[
    {
        "source": "https://www.delish.com/cooking/recipe-ideas/a41498404/air-fryer-beef-and-broccoli-recipe/",
        "recipeName": "BEEF & BROCCOLI",
        "ingredients": [
            "1/2 c. low-sodium chicken broth",
            "3 tbsp. reduced-sodium soy sauce",
            "2 tbsp. packed light brown sugar",
            "1 tbsp. cornstarch",
            "1 tsp. Shaoxing wine or dry sherry",
            "1 tsp. toasted sesame oil",
            "Freshly ground black pepper",
            "1 lb. flank or skirt steak",
            "2 cloves garlic, finely chopped",
            "1 tbsp. reduced-sodium soy sauce",
            "2 tsp. cornstarch",
            "2 tsp. finely chopped peeled fresh ginger",
            "2 tsp. Shaoxing wine or dry sherry",
            "12 oz. small broccoli florets (from about 2 heads)",
            "2 tbsp. vegetable oil",
            "Thinly sliced scallions, toasted sesame seeds, and steamed or sticky rice, for serving"
        ],
        "instructions": [
            "In a medium heatproof bowl, whisk broth, soy sauce, brown sugar, cornstarch, and wine. Microwave on high, stirring halfway through, until sauce is thickened, about 2 minutes. Stir in oil and season with a few grinds of black pepper.",
            "In another medium bowl, toss steak with garlic, soy sauce, cornstarch, ginger, and wine. Let sit 5 minutes. Add broccoli and oil and toss to combine.",
            "Arrange half of steak and broccoli mixture in a single layer in an air fryer basket. Cook at 400F until steak is just cooked through and broccoli is tender and golden in spots, 8 to 10 minutes. Scrape cooked steak and broccoli mixture into a bowl with sauce.",
            "Repeat with the remaining steak and broccoli mixture, then toss to coat in the sauce.",
            "Sprinkle with scallions and sesame seeds. Serve over rice."
        ]
    },
    {
        "source": "https://www.beefitswhatsfordinner.com/recipes/recipe/55564/beef-chili",
        "recipeName": "BEEF CHILI",
        "ingredients": [
            "1 pound Ground Beef (96% lean)",
            "1 can (15 ounces) reduced-sodium black beans, rinsed and drained",
            "1 can (14-1/2 ounces) unsalted beef broth",
            "1 can (14-1/2 ounces) unsalted diced tomatoes",
            "1 can (4 ounces) diced green chilies or sliced jalapeno peppers",
            "2 tablespoons chili powder"
        ],
        "instructions": [
            "Heat a large nonstick skillet over medium heat until hot. Add Ground Beef and cook 8 to 10 minutes, breaking into 3/4-inch crumbles and stirring occasionally. Pour off drippings.",
            "Stir in beans, broth, tomatoes, green chilies, and chili powder. Bring to a boil. Reduce heat, cover, and simmer for 20 minutes to develop flavors, stirring occasionally.",
            "Garnish with Toppings, as desired."
        ]
    },
    {
        "source": "https://www.beefitswhatsfordinner.com/recipes/recipe/1344/lazy-beef-lasagna",
        "recipeName": "BEEF LASAGNA",
        "ingredients": [
            "1-1/2 pounds Ground Beef (93% lean or leaner)",
            "1 tablespoon minced garlic",
            "1/2 teaspoon salt",
            "1/4 to 1/2 teaspoon ground nutmeg",
            "1/4 teaspoon pepper",
            "1 jar (26 ounces) prepared pasta or marinara sauce",
            "1-1/2 cups water",
            "1 package (20 to 25 ounces) refrigerated or frozen cheese ravioli",
            "1 cup shredded Italian cheese blend"
        ],
        "instructions": [
            "Heat oven to 400F. Heat a large nonstick skillet over medium heat until hot. Add Ground Beef and garlic; cook 8 to 10 minutes, breaking into 3/4-inch crumbles and stirring occasionally. Remove from skillet with slotted spoon; pour off drippings and return beef to skillet.",
            "Stir in salt, nutmeg, and pepper; mix well. Stir in pasta sauce and water; bring to a boil. Cook 1 to 2 minutes, stirring occasionally.",
            "Coat a 13 x 9-inch glass baking dish with cooking spray. Layer half the ravioli, half the beef mixture, and half the cheese. Repeat with remaining ravioli, beef mixture, and cheese; cover with aluminum foil. Bake in a 400°F oven for 15 minutes (20 minutes if using frozen ravioli). Uncover; continue baking 15 to 20 minutes or until sauce is bubbly and pasta is tender.",
            "Let stand 5 minutes before serving."
        ]
    },
    {
        "source": "https://www.delish.com/cooking/recipe-ideas/a23515497/easy-beef-stew-recipe/",
        "recipeName": "BEEF STEW",
        "ingredients": [
            "1 tbsp. (or more) vegetable oil",
            "2 lb. beef chuck stew meat, cut into 1\" cubes",
            "1 medium yellow onion, chopped",
            "2 carrots, peeled, cut into rounds",
            "2 stalks celery, chopped",
            "Kosher salt",
            "Freshly ground black pepper",
            "3 cloves garlic, finely chopped",
            "1/4 c. tomato paste",
            "6 c. low-sodium beef broth",
            "1 c. red wine",
            "1 tbsp. Worcestershire sauce",
            "2 fresh thyme sprigs",
            "2 bay leaves",
            "1 lb. baby potatoes, halved",
            "1 c. frozen peas",
            "1/4 c. chopped fresh parsley"
        ],
        "instructions": [
            "In a large Dutch oven or heavy pot over medium heat, heat oil. Add beef and cook, turning occasionally, until seared on all sides, about 10 minutes. Transfer beef to a plate.",
            "Coat the bottom of the pot with oil, if needed, and heat over medium-high heat. Cook onion, carrots, and celery, stirring, until softened, about 7 minutes; season with salt and pepper. Add garlic and tomato paste and cook, stirring, until garlic is fragrant and tomato paste has darkened, about 2 minutes. Return beef to pot.",
            "Add broth, wine, Worcestershire, thyme, and bay leaves. Bring to a boil, then reduce heat to medium-low and bring to a simmer; season with salt and pepper. Cover and simmer, stirring occasionally, until beef is tender, 30 to 45 minutes.",
            "Add potatoes and simmer, covered, until potatoes are tender, about 15 minutes.",
            "Remove bay leaves and thyme. Stir in peas and cook, stirring, until warmed through, about 2 minutes; season with salt and pepper.",
            "Divide stew among bowls. Top with parsley."
        ]
    },
    {
        "source": "https://www.muydelish.com/bistec-ranchero/",
        "recipeName": "BISTEC RANCHERO (RANCH-STYLE STEAK)",
        "ingredients": [
            "1 cup vegetable oil",
            "2 medium russet potatoes or 3 smaller potatoes thinly sliced",
            "1 lb steak thinly sliced",
            "1 garlic clove chopped",
            "1/2 medium white or yellow onion thinly sliced",
            "1 chile Anaheim, jalapeno, or serrano peppers (see note 1) remove seeds for a less spicy dish",
            "3 Roma tomatoes",
            "4 oz Tomato sauce",
            "1/2 tsp kosher salt or more to taste",
            "1/4 tsp black ground pepper or more to taste",
            "1 cup water or more if needed while cooking"
        ],
        "instructions": [
            "In a large skillet, add the oil and heat over medium-high heat. Cook the potatoes and spread them on the skillet to cook evenly. Cook for about 5 minutes or until cooked through and golden brown.",
            "Remove from the skillet and place on paper towels to drain oil. Season with salt & pepper to taste.",
            "In the same skillet, remove carefully most of the oil, only leaving about two tablespoons behind.",
            "Over medium heat, cook the beef & garlic until the meat is almost all cooked through, about 4 minutes.",
            "Add the onions and peppers and cook until onions start to soften, about 2 minutes. If this mixture is starting to dry, add about 1 cup of water.",
            "Add the tomatoes, tomato sauce, 1/2 teaspoon kosher salt, and 1/4 teaspoon ground black pepper. Cook for 2 minutes.",
            "Once the tomatoes are soft, add the potatoes and mix well. Cover the skillet with a lid and simmer on low heat for about 5 minutes to blend all of the flavors together.",
            "Taste and add salt & pepper to see if it needs more."
        ]
    },
    {
        "source": "https://www.beefitswhatsfordinner.com/recipes/recipe/55558/classic-beef-meatloaf",
        "recipeName": "MEATLOAF",
        "ingredients": [
            "1-1/2 pounds Ground Beef (93% lean or leaner)",
            "3/4 cup panko bread crumbs",
            "3/4 cup ketchup, divided",
            "1/2 cup minced onion",
            "1 egg",
            "1 tablespoon Worcestershire sauce",
            "2 teaspoons minced garlic",
            "1 teaspoon dried thyme",
            "3/4 teaspoon pepper",
            "1/2 teaspoon salt"
        ],
        "instructions": [
            "Preheat oven to 350F. Combine Ground Beef, bread crumbs, 1/2 cup ketchup, onion, egg, Worcestershire, garlic, thyme, pepper, and salt in a large bowl, mixing lightly but thoroughly. Shape beef into 8 x 4-inch loaf on rack in an aluminum foil-lined broiler pan.",
            "Place on the upper oven rack in a 350F oven. Bake 45 to 55 minutes until an instant-read thermometer inserted into the center registers 160°F. Brush with the remaining 1/4 cup ketchup during the last 10 minutes, if desired.",
            "Let stand for 10 minutes. Cut into slices."
        ]
    },
    {
        "source": "https://www.muydelish.com/milanesa/",
        "recipeName": "MILANESAS DE RES",
        "ingredients": [
            "1 pound thin steaks",
            "1 cup all-purpose flour",
            "3 large eggs",
            "2 cups bread crumbs or as needed",
            "2 cups avocado or canola oil or as needed",
            "Salt & pepper"
        ],
        "instructions": [
            "Put the steak between two sheets of plastic wrap. Use a flat meat mallet to pound it to 1/8 inch thick. Repeat with remaining meat.",
            "To begin, season the Milanesa steaks with salt and pepper.",
            "Into a large shallow bowl, add the flour.",
            "Into a large shallow bowl, crack 3 eggs, add 0.5 cup milk and beat with a fork until mixed well.",
            "In another shallow bowl, add the breadcrumbs and season with salt and black pepper.",
            "Dredge one piece of Milanesa steak in flour, coating lightly on all sides. Then put it into the eggs, coating it fully. Use a tong to handle the meat in the egg mixture to prevent your fingers from getting messy.",
            "Place it onto the breadcrumb mixture. Use your fingers to mound breadcrumbs on top of the meat then press down to adhere crumbs to the meat. Flip and repeat. Place meat on a large plate. Repeat with the rest of the meat pieces.",
            "In a large skillet, add enough oil to cover the bottom completely by about 0.5 inch. Heat skillet over medium until very hot and shimmering.",
            "Add two Milanesa steaks in a single layer and cook until brown, about 1-2 minutes. Flip and brown on the other side. Transfer to a paper plate lined with paper towels. Repeat this cooking step with the rest of the beef.",
            "Serve immediately while warm."
        ]
    },
    {
        "source": "https://houseofyumm.com/mexican-picadillo/",
        "recipeName": "PICADILLO",
        "ingredients": [
            "1 lb ground beef",
            "0.5 cup onion, diced",
            "1 green bell pepper, diced",
            "2 cups potato, peeled and diced",
            "4 cloves garlic, minced",
            "8 ounces tomato sauce",
            "1.5 cups beef broth",
            "1 tsp salt",
            "0.25 tsp ground black pepper",
            "1 tsp ground cumin",
            "1 tsp ground coriander",
            "1 bay leaf"
        ],
        "instructions": [
            "Heat a large skillet over medium heat, add ground beef. Cook over medium heat while breaking up the meat. Cook until mostly browned, drain grease, and return to heat.",
            "Add in diced onion, green bell pepper, and potatoes. Continue to cook over medium heat until onion and peppers are softened. Add garlic and cook an additional 30 seconds.",
            "Pour in tomato sauce and beef broth. Add in seasonings: salt, pepper, cumin, and coriander. Stir to combine. Add bay leaf.",
            "Bring the mixture to a simmer, cover, and let cook for 10 minutes.",
            "Remove the lid, stir, and continue cooking with the lid off for an additional 10 minutes or until potatoes are softened and most of the liquid is gone.",
            "Serve warm with flour tortillas and rice."
        ]
    },
    {
        "source": "https://www.tasteofhome.com/recipes/speedy-shepherd-s-pie/",
        "recipeName": "SHEPHERDS PIE",
        "ingredients": [
            "1-1/2 pounds ground beef",
            "1 medium onion, chopped",
            "2 garlic cloves, minced",
            "1/2 cup water",
            "1 envelope taco seasoning",
            "2 cups shredded cheddar cheese, divided",
            "3 cups leftover or refrigerated mashed potatoes, warmed"
        ],
        "instructions": [
            "Preheat broiler. In a large ovenproof skillet, cook beef, onion, and garlic over medium heat until beef is no longer pink, breaking up beef into crumbles; drain. Stir in water and taco seasoning; heat through. Stir in 1 cup cheese. Remove from heat.",
            "In a bowl, mix mashed potatoes and remaining cheese; spread over beef mixture. Broil 4-6 in. from heat 5-6 minutes or until the top is golden brown."
        ]
    },
    {
        "source": "https://addapinch.com/steak-fajitas-recipe/",
        "recipeName": "STEAK FAJITAS",
        "ingredients": [
            "2 pounds skirt, flank, sirloin, or hanger steak, sliced into 1/2 inch strips",
            "1 red pepper, deseeded and sliced into thin strips",
            "1 bell pepper, deseeded and sliced into thin strips",
            "1 medium onion, peeled and sliced into thin strips",
            "3 tablespoons olive oil",
            "1 tablespoon lime juice",
            "1/2 teaspoon chili powder",
            "1 teaspoon ground cumin",
            "Pinch cayenne pepper",
            "1/2 teaspoon Kosher salt",
            "1/2 teaspoon ground black pepper",
            "2 cloves garlic, minced",
            "6-8 tortillas, warmed"
        ],
        "instructions": [
            "Place the steak into a sealable bag. Place the peppers and onion into a separate sealable bag. Add the olive oil, lime juice, chili powder, ground cumin, cayenne pepper, salt, black pepper, and garlic to a jar with a screw top or tight-fitting lid. Shake until well combined. Pour 1/3 of the marinade over steak, 1/3 of marinade over vegetables, and reserve the remaining marinade in the jar for using when cooking the steak fajitas. Seal the bags tightly and refrigerate for one hour to overnight.",
            "When ready to cook, heat a large skillet over medium-high heat. Pour the vegetables into the skillet and cook until just tender-crisp, about 5 minutes. Remove the vegetables from the skillet to a plate and add steak strips to the same skillet. When the steak is cooked throughout (about 7-10 minutes), add vegetables back to the skillet along with the reserved marinade.",
            "Serve with warm tortillas and desired optional garnishes."
        ]
    }
]